package com.yunli.bigdata.dsep.service.common.constant;

import com.yunli.bigdata.dsep.service.common.exception.ErrorCode;

/**
 * 全局Message
 *
 * @author zhangws
 */
public enum CommonMessageCode implements ErrorCode {
  /**
   *
   */
  INFO_200(200, "成功"),
  INFO_201(201, "已创建"),
  ERROR_401(401, "无权操作"),
  ERROR_401_2(401, "%s"),
  ERROR_500(500, "系统异常"),

  // 参数校验Code定义：1000 ~ 1099
  ERROR_1001(1001, "%s不能为空"),
  ERROR_1002(1002, "%s的值只能为[%s]"),
  ERROR_1003(1003, "%s的长度不能超过[%s]"),
  ERROR_1004(1004, "%s[%s]无效"),
  ERROR_1005(1005, "%s不能大于%s[%s，%s]"),
  ERROR_1006(1006, "%s不能重复"),
  ERROR_1007(1007, "%s必须是正整数"),
  ERROR_1008(1008, "%s[%s]格式不正确"),
  ERROR_1009(1009, "%s[%s]不能包含[%s]等字符"),

  // 共通业务Code定义：1100 ~ 1199
  ERROR_1100(1100, "%s[%s]已经存在"),
  ERROR_1101(1101, "%s[%s]不存在"),
  ERROR_1102(1102, "%s[%s]不能重复"),
  ERROR_1103(1103, "结束时间不能小于开始时间"),
  ERROR_1104(1104, "登录已过期,请重新登录"),
  ERROR_1105(1105, "%s[%s]不支持"),
  ERROR_1106(1106, "底座[%s]访问异常"),
  // 审计服务Code定义：2000 ~ 2099

  // 鉴权服务Code定义：2100 ~ 2199
  ERROR_2100(2100, "[%s]生成默认权限失败"),
  ERROR_2101(2101, "用户[%s]的公钥为空，请重新生成AKSK"),
  ERROR_2102(2102, "免密码已过期"),
  ERROR_2103(2103, "获取token失败"),
  ERROR_2104(2104, "授权失败[%s]"),
  ERROR_2105(2105, "无权%s[%s]"),
  ERROR_2106(2106, "调用应用中台接口失败[%s]%s"),

  // 数据血缘服务Code定义：2200 ~ 2299
//  ERROR_2200(2200, "该数据表[resourceId=%d]已是主节点，不能再选为上游节点"),
//  ERROR_2201(2201, "该数据表[resourceId=%d]已是主节点，不能再选为下游节点"),
//  ERROR_2202(2202, "已选为上游节点的数据表[%s]，不能再选为下游节点"),
//  ERROR_2203(2203, "已选为下游节点的数据表[%s]，不能再选为上游节点"),

  // 数据表服务Code定义：2300 ~ 2399
  ERROR_2300(2300, "该数据表[%s]不是分区表"),
  ERROR_2301(2301, "该数据表[%s]分区列个数不匹配[目标：%s，实际：%s]"),
  ERROR_2302(2302, "该数据表[%s]的列[%s]不是分区列"),
  ERROR_2303(2303, "该数据表[%s]在引擎中增加分区失败"),
  ERROR_2304(2304, "CSV文件导入失败"),
  ERROR_2305(2305, "数据表[%s]未发布，请先发布"),
  ERROR_2306(2306, "未找到数据表[%s]的存储信息"),
  ERROR_2307(2307, "未找到数据表[%s]的交互式存储信息"),
  ERROR_2308(2308, "该数据表[%s]是分区表，请传入分区"),
  ERROR_2309(2309, "非法的查询条件[%s]"),
  ERROR_2310(2310, "数据表必须含有非分区字段"),
  ERROR_2311(2311, "数据表[%s]内存在数据，此修改会造成数据丢失，是否继续?"),
  ERROR_2312(2312, "获取数据表的权限时异常"),
  ERROR_2313(2313, "[%s]的资源不能%s"),
  //  ERROR_2314(2314, "设置责任人或资源提供方失败"), 见 ERROR_2100
  ERROR_2315(2315, "分区字段必须是string类型"),
  ERROR_2316(2316, "该存储下有数据表，不能删除"),
  ERROR_2317(2317, "该存储下有数据表，不能修改连接信息"),
  ERROR_2318(2318, "资源的状态未变化"),
  ERROR_2319(2319, "[%s]的资源不能改为[%s]"),
  ERROR_2320(2320, "已下架的资源才能删除"),
  ERROR_2321(2321, "删除数据表的血缘关系失败[%s]"),
  ERROR_2322(2322, "CSV文件列数与目标表列数不一致，导入失败"),
  ERROR_2323(2323, "资源[%s]存在已启用的作业[%s]，此操作会自动停止作业，是否继续？"),
  ERROR_2324(2324, "自动停止作业[%s]失败"),
  ERROR_2325(2325, "交互式查询引擎连接失败"),
  ERROR_2326(2326, "数据底座存储信息解析失败"),
  ERROR_2327(2327, "获取资源[%s]的审批者失败"),
  ERROR_2328(2328, "调用工作流失败"),
  ERROR_2329(2329, "过滤条件不能使用limit，请设置分页参数"),
  ERROR_2330(2330, "调用工作流失败:[%s]"),
  ERROR_2331(2331, "只有未发布的资源才能申请发布"),
  ERROR_2332(2332, "您已拥有访问此资源的权限，可直接访问"),
  ERROR_2333(2333, "申请[%s]已被审批，请勿重复审批"),
  ERROR_2334(2334, "申请已存在，请勿重复申请"),
  ERROR_2335(2335, "创建[%s]资源[%s]失败"),
  ERROR_2336(2336, "删除[%s]资源[%s]失败"),
  ERROR_2337(2337, "创建%s[%s]失败"),
  ERROR_2338(2338, "删除%s[%s]失败"),
  ERROR_2339(2339, "上传%s[%s]失败"),
  ERROR_2340(2340, "下载%s[%s]失败"),
  ERROR_2341(2341, "重命名%s[旧=%s, 新=%s]失败"),
  ERROR_2342(2342, "文件名不合法[%s]，请输入符合Windows文件命名规则的文件名"),
  ERROR_2343(2343, "%s[%s]已存在，是否继续？"),
  ERROR_2344(2344, "%s[%s]未发布"),
  // 数据统计服务Code定义：2400 ~ 2499
  // 数据目录服务Code定义：2500 ~ 2599
//  ERROR_2500(2500, "设置责任人或资源提供方失败"), 见 ERROR_2100
  ERROR_2501(2501, "上级目录不能是自己的子目录"),
  ERROR_2502(2502, "已发布的目录的上级目录也必须已发布"),
  ERROR_2503(2503, "已发布的目录的上级目录也必须已发布"),
  ERROR_2504(2504, "目录[%s]下已关联数据表，请取消关联后再下架"),
  ERROR_2505(2505, "目录[%s]下已关联文件夹，请取消关联后再下架"),
  ERROR_2506(2506, "目录[%s]下已关联实时数据通道，请取消关联后再下架"),
  // 作业管理服务Code定义：2600 ~ 2699
  ERROR_2600(2600, "补数据的时间范围必须在作业有效期内[%s，%s]"),
  ERROR_2601(2601, "仅待运行和暂停中状态的任务，才能被修改"),
  ERROR_2602(2602, "任务创建异常[code=%s, jobId=%s]"),
  ERROR_2603(2603, "作业参数配置无效，且Key不能重复【格式例 k1=v1;k2=v2】"),
  ERROR_2604(2604, "必须进行字段映射"),
  ERROR_2605(2605, "目标表的字段必须全部被映射[%s]"),
  ERROR_2606(2606, "数据源连接信息有误[%s]"),
  ERROR_2607(2607, "数据源连接失败"),
  ERROR_2608(2608, "导入目标的字段映射中，必须包含字段和类型"),
  ERROR_2609(2609, "字段映射的类型不兼容，[源字段名：%s, 源字段类型：%s; 目标类型只能为：%s]"),
  ERROR_2610(2610, "字段映射的类型[%s表的%s]不被支持，请使用别的方案进行解决。比如存入第三方存储系统"),
  ERROR_2611(2611, "数据源[%s]访问失败，无法获取[%s]的列信息"),
  ERROR_2612(2612, "数据来源配置[数据源连接信息、来源表]不正确，请确认配置信息"),
  ERROR_2613(2613, "数据去向配置[数据源连接信息、来源表]不正确，请确认配置信息"),
  ERROR_2614(2614, "%s的字段类型[表：%s；字段：%s]被修改，请重新确认映射连线。[旧类型：%s；新类型：%s]"),
  ERROR_2615(2615, "分区%s的的值只能为[%s]"),
  ERROR_2616(2616, "该目标源[%s]已存在启动的同步作业[%s]"),
  ERROR_2617(2617, "该目标源[%s]的分区[%s]不能为空"),
  // 作业调度服务Code定义：2700 ~ 2799
  ERROR_2700(2700, "模板中的[%s]数据源信息不存在[%s]"),
  // 用户管理服务Code定义：2800 ~ 2899
  ERROR_2800(2800, "从钉钉获取token失败"),
  ERROR_2801(2801, "从钉钉获取用户详情失败"),
  ERROR_2802(2802, "从钉钉获取组织详情失败"),
  // 角色管理服务Code定义：2900 ~ 2999
  // 组管理服务Code定义：3000 ~ 3099
  // DumpService Code定义：3100 ~ 3199
  ERROR_3100(3100, "%s无法转成JSON字符串"),
  ERROR_3101(3101, "%sJSON字符串无法转成对象"),
  ERROR_3102(3102, "%s不能都为空"),

  // 消息管理接口
  ERROR_3200(3200, "调用消息服务失败: %s"),
  ;

  private int code;

  private String message;

  CommonMessageCode(int code, String message) {
    this.code = code;
    this.message = message;
  }

  @Override
  public int getCode() {
    return code;
  }

  public void setCode(int code) {
    this.code = code;
  }

  @Override
  public String getMessage() {
    return message;
  }

  public void setMessage(String message) {
    this.message = message;
  }
}
